#!/usr/bin/env python
#-*- encoding: utf-8 -*-

# Το βασικό import
import gtk

# Η κυρίως κλάση μας
class HelloWorld(object):

   # Αυτή η μέθοδος εκτελείται όταν ο χρήστης κλείσει το παράθυρο
   def destroy(self, widget, data=None):

       # Αυτή η μέθοδος καλεί μόνο την gtk.main_quit() για τον τερματισμό του παραθύρου
       gtk.main_quit()

   # Η μέθοδος που καλείται όταν φτιάχνουμε το κυρίως αντικείμενό μας
   def __init__(self):

       # Το παράρθυρο μας, δημιουργείται με την gtk.Window
       self.window = gtk.Window(gtk.WINDOW_TOPLEVEL)

       # Όταν ο χρήστης πατήσει το X για να κλείσει το παράθυρο στέλνεται το σήμα destroy
       # Συνδέουμε αυτό το σήμα με την παραπάνω μέθοδο μας
       self.window.connect("destroy", self.destroy)

       # Ορίζουμε τον τίτλο του παραθύρου, που εμφανίζεται στην μπάρα.
       self.window.set_title("Γεια σου κόσμε!")

       # Ορίζουμε το μέγεθος του παραθύρου
       self.window.set_default_size(250,100)

       # Φτιάχνουμε ένα label με το string "Hello World"
       self.label = gtk.Label("Γεια σου κόσμε!")

       # Προσθέτουμε το label στο παράθυρο
       self.window.add(self.label)

       # Δείχνουμε το label
       self.label.show()

       # Δείχνουμε στο τέλος το παράθυρο
       self.window.show()

   # Η μέθοδος που καλεί την gtk.main() η οποία είναι υπεύθυνη για όλο τον σχεδιασμό
   # και εμφάνιση του παραθύρου. Όταν εκτελεστεί αυτή ο έλεγχος περνάει στο παράθυρο.
   # Ο μόνος τρόπος επικοινωνίας παραθύρου και προγράμματος είναι μέσα από τα σήματα.
   def main(self):
       gtk.main()
       # Όταν καλέσουμε την main_quit() σαν αποτέλεσμα του destroy σήματος το πρόγραμμα θα συνεχίσει από εδώ.
       # Μιας και δεν έχει άλλες εντολές θα τερματίσει.

if __name__ == "__main__":
   #Δημιουργούμε το βασικό αντικείμενο μας από την κλάση μας και καλούμε την main μέθοδο του
   hello = HelloWorld()
   hello.main()
